In [1]:
import pandas as pd

In [2]:
# Load in Raw Data
title_basics = pd.read_csv('Data/movie_basics.csv')
title_basics.info()
title_basics.head(5)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 86979 entries, 0 to 86978
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Unnamed: 0      86979 non-null  int64
 1   tconst          86979 non-null  object
 2   titleType       86979 non-null  object
 3   primaryTitle    86979 non-null  object
 4   originalTitle   86979 non-null  object
 5   isAdult         86979 non-null  int64
 6   startYear       86979 non-null  float64
 7   endYear         0 non-null      float64
 8   runtimeMinutes  86979 non-null  int64
 9   genres          86979 non-null  object
dtypes: float64(2), int64(3), object(5)
memory usage: 6.6+ MB

,Unnamed: 0,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,34802,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,61114,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
2,67666,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
3,86793,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"
4,93930,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama

In [3]:
# Load in Raw Data
ratings = pd.read_csv('Data/movie_ratings.csv')
ratings.info()
ratings.head(5)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 504000 entries, 0 to 503999
Data columns (total 4 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   Unnamed: 0     504000 non-null  int64
 1   tconst         504000 non-null  object
 2   averageRating  504000 non-null  float64
 3   numVotes       504000 non-null  int64
dtypes: float64(1), int64(2), object(1)
memory usage: 15.4+ MB

   Unnamed: 0     tconst  averageRating  numVotes
0           0  tt0000001            5.7      1988
1           1  tt0000002            5.8       265
2           4  tt0000005            6.2      2632
3           5  tt0000006            5.1       182
4           6  tt0000007            5.4       825

In [4]:
# Calculate max string lenghts for object columns
tconst_length = title_basics['tconst'].fillna('').map(len).max()
tconst_length

10

In [5]:
# Calculate max string lenghts for object columns
primaryTitle_length = title_basics['primaryTitle'].fillna('').map(len).max()
primaryTitle_length

242

![png](Data/movies.png)

In [6]:
from sqlalchemy.engine import create_engine
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus
username = "root"
password = quote_plus("908@Ad534")
db_name = "movies"
connection = f'mysql+pymysql://{username}:{password}@localhost/{db_name}'

In [7]:
engine = create_engine(connection)
conn = engine.connect()

In [8]:
# Preview the names of all tables 
q = '''SHOW TABLES;'''
pd.read_sql(q, conn)

  Tables_in_movies
0           genres
1          ratings
2     title_basics
3     title_genres

In [9]:
q= '''SELECT * FROM title_basics'''
pd.read_sql(q, conn)

Empty DataFrame
Columns: [tconst, primary_title, start_year, runtime]
Index: []

In [10]:
q = '''DESCRIBE title_basics;'''
describe = pd.read_sql(q, conn)
describe

           Field          Type Null  Key Default Extra
0         tconst   varchar(10)   NO  PRI    None
1  primary_title  varchar(275)  YES         None
2     start_year           int  YES         None
3        runtime           int  YES         None

In [11]:
# Checking describe's Field names
describe['Field'].values

array(['tconst', 'primary_title', 'start_year', 'runtime'], dtype=object)

In [12]:
# Checking dataframe's columns
title_basics.columns

Index(['Unnamed: 0', 'tconst', 'titleType', 'primaryTitle', 'originalTitle',
       'isAdult', 'startYear', 'endYear', 'runtimeMinutes', 'genres'],
      dtype='object')

In [13]:
# Rename columns to match SQL table
rename_map = {"primaryTitle":"primary_title",
             "startYear":"start_year",
             "runtimeMinutes":"runtime"}
title_basics = title_basics.rename(rename_map,axis=1)
title_basics.head(2)

,Unnamed: 0,tconst,titleType,primary_title,originalTitle,isAdult,start_year,endYear,runtime,genres
0,34802,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,61114,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama

In [21]:
# Dropping columns
title_basics = title_basics.drop(columns = ['titleType'])
title_basics.head()

,tconst,primary_title,start_year,runtime
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0088751,The Naked Monster,2005.0,100
4,tt0096056,Crime and Punishment,2002.0,126

In [15]:
# Reviewing SQL table's data types
describe[['Field','Type']]

           Field          Type
0         tconst   varchar(10)
1  primary_title  varchar(275)
2     start_year           int
3        runtime           int

In [16]:
# Reviewing dataframe's data types
title_basics.dtypes

tconst            object
titleType         object
primary_title     object
originalTitle     object
isAdult            int64
start_year       float64
endYear          float64
runtime            int64
genres            object
dtype: object

In [22]:
title_basics.to_sql("title_basics",conn,index=False, if_exists='append')

86979

In [23]:
# confirm the data has been added
q = """SELECT * FROM title_basics
LIMIT 5;"""
pd.read_sql(q,conn)

,tconst,primary_title,start_year,runtime
0,tt0035423,Kate & Leopold,2001,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70
2,tt0069049,The Other Side of the Wind,2018,122
3,tt0088751,The Naked Monster,2005,100
4,tt0096056,Crime and Punishment,2002,126

In [24]:
# check the describe again to confirm no changes
q = """DESCRIBE title_basics;"""
pd.read_sql(q,conn)

           Field          Type Null  Key Default Extra
0         tconst   varchar(10)   NO  PRI    None
1  primary_title  varchar(275)  YES         None
2     start_year           int  YES         None
3        runtime           int  YES         None

In [25]:
# Load in Raw Data
ratings = pd.read_csv('Data/movie_ratings.csv')
ratings.info()
ratings.head(5)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 504000 entries, 0 to 503999
Data columns (total 4 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   Unnamed: 0     504000 non-null  int64
 1   tconst         504000 non-null  object
 2   averageRating  504000 non-null  float64
 3   numVotes       504000 non-null  int64
dtypes: float64(1), int64(2), object(1)
memory usage: 15.4+ MB

   Unnamed: 0     tconst  averageRating  numVotes
0           0  tt0000001            5.7      1988
1           1  tt0000002            5.8       265
2           4  tt0000005            6.2      2632
3           5  tt0000006            5.1       182
4           6  tt0000007            5.4       825

In [26]:
# Drop Unnamed Column
ratings = ratings.drop(columns = 'Unnamed: 0')
ratings.head(5)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1988
1  tt0000002            5.8       265
2  tt0000005            6.2      2632
3  tt0000006            5.1       182
4  tt0000007            5.4       825

In [27]:
q= '''SELECT * FROM ratings'''
pd.read_sql(q, conn)

Empty DataFrame
Columns: [tconst, average_rating, number_of_votes]
Index: []

In [28]:
q = '''DESCRIBE ratings;'''
describe = pd.read_sql(q, conn)
describe

             Field          Type Null  Key Default Extra
0           tconst   varchar(10)   NO  PRI    None
1   average_rating  decimal(2,0)  YES         None
2  number_of_votes           int  YES         None

In [29]:
# Checking describe's Field names
describe['Field'].values

array(['tconst', 'average_rating', 'number_of_votes'], dtype=object)

In [30]:
# Checking dataframe's columns
ratings.columns

Index(['tconst', 'averageRating', 'numVotes'], dtype='object')

In [31]:
# Rename columns to match SQL table
rename_map = {"averageRating":"average_rating",
             "numVotes":"number_of_votes"}
ratings = ratings.rename(rename_map,axis=1)
ratings.head(2)

      tconst  average_rating  number_of_votes
0  tt0000001             5.7             1988
1  tt0000002             5.8              265

In [32]:
# Reviewing SQL table's data types
describe[['Field','Type']]

             Field          Type
0           tconst   varchar(10)
1   average_rating  decimal(2,0)
2  number_of_votes           int

In [33]:
# Reviewing dataframe's data types
ratings.dtypes

tconst              object
average_rating     float64
number_of_votes      int64
dtype: object

In [34]:
ratings.to_sql("ratings",conn,index=False, if_exists='append')

504000

In [36]:
# confirm the data has been added
q = """SELECT * FROM ratings
LIMIT 5;"""
pd.read_sql(q,conn)

      tconst  average_rating  number_of_votes
0  tt0000001             6.0             1988
1  tt0000002             6.0              265
2  tt0000005             6.0             2632
3  tt0000006             5.0              182
4  tt0000007             5.0              825

In [37]:
# check the describe again to confirm no changes
q = """DESCRIBE ratings;"""
pd.read_sql(q,conn)

             Field          Type Null  Key Default Extra
0           tconst   varchar(10)   NO  PRI    None
1   average_rating  decimal(2,0)  YES         None
2  number_of_votes           int  YES         None

In [38]:
q = """DESCRIBE genres;"""
pd.read_sql(q,conn)

        Field         Type Null  Key Default Extra
0      tconst  varchar(10)   NO  PRI    None
1    genre_id          int  YES         None
2  genre_name  varchar(45)  YES         None

In [39]:
q = """DESCRIBE title_genres;"""
pd.read_sql(q,conn)

                 Field         Type Null  Key Default Extra
0  title_basics_tconst  varchar(10)   NO  PRI    None
1             genre_id  varchar(10)   NO  PRI    None